In [25]:
!pip3 install pandas

Collecting pandas
  Downloading pandas-1.5.1-cp310-cp310-win_amd64.whl (10.4 MB)
     --------------------------------------- 10.4/10.4 MB 11.3 MB/s eta 0:00:00
Collecting numpy>=1.21.0
  Downloading numpy-1.23.4-cp310-cp310-win_amd64.whl (14.6 MB)
     ---------------------------------------- 14.6/14.6 MB 9.2 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in d:\python\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2022.5-py2.py3-none-any.whl (500 kB)
     ------------------------------------- 500.7/500.7 kB 10.4 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in d:\python\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.23.4 pandas-1.5.1 pytz-2022.5

WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (d:\python\lib\site-packages)

In [26]:
import pymysql

import pandas as pd

In [27]:
conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='123456',db='mydb')

In [28]:
cursor = conn.cursor(pymysql.cursors.DictCursor)

In [34]:
drivers_df=pd.read_sql_query("SELECT * FROM driver",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\3084744936.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  drivers_df=pd.read_sql_query("SELECT * FROM driver",conn)

In [35]:
drivers_df

,driver id,name,license,security clearnance level,language,FATL level,FATL date,STLVT level,STLVT date,STLVT Certifying Authority
0,1,Andrew,123456789000000000,1,English,NaN,None,NaN,None,None
1,2,David,123456789000000001,2,Japanese,2.0,2015-10-10,NaN,None,None
2,3,Enoch,123456789000000002,3,German,9.0,2014-09-15,4.0,2016-11-23,ADT Inc.
3,4,George,123456789000000003,4,Korean,NaN,None,2.0,2018-04-20,ADT Inc.

In [37]:
booking_df=pd.read_sql_query("SELECT * FROM bookingservice",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\1368223808.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  booking_df=pd.read_sql_query("SELECT * FROM bookingservice",conn)

In [38]:
booking_df

,booking id,booking reference number,pickup location,dropoff location,driver id,official id,start time,end time,start odometer,end odometer,vehicle id
0,1,1,1,2,1,2,2022-10-01 12:00:00,2022-10-01 13:15:00,0,78,1000
1,2,2,3,4,2,4,2022-10-03 11:00:00,2022-10-03 15:00:00,0,95,1001
2,3,3,5,6,3,3,2022-10-05 14:00:00,2022-10-05 15:10:00,0,49,1002

In [43]:
location_df=pd.read_sql_query("SELECT * FROM location",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\1063688167.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  location_df=pd.read_sql_query("SELECT * FROM location",conn)

In [44]:
official_df=pd.read_sql_query("SELECT * FROM official",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\770532133.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  official_df=pd.read_sql_query("SELECT * FROM official",conn)

In [45]:
vehicle_maintenance_df=pd.read_sql_query("SELECT * FROM vehicle_maintenance",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\380299149.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vehicle_maintenance_df=pd.read_sql_query("SELECT * FROM vehicle_maintenance",conn)

In [40]:
vehicle_list_df=pd.read_sql_query("SELECT * FROM vehicle_list",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\3853487725.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vehicle_list_df=pd.read_sql_query("SELECT * FROM vehicle_list",conn)

In [46]:
location_df

,location id,address,name,type
0,1,"123, Central-ro, Yeonsu-gu, Incheon, Republic ...",Incheon Central Park,Park
1,2,"43, Songnae-daero, Bucheon-si, Gyeonggi-do, Re...",Song Nae Station,Station
2,3,"269, Jemullyang-ro, Jung-gu, Incheon, Republic...",Incheon Station,Station
3,4,"175, Biryu-daero, Yeonsu-gu, Incheon, Republic...",Song Do Station,Station
4,5,"15, Gwangjang-ro, Bupyeong-gu, Incheon, Republ...",Bupyeong Station,Station
5,6,"'271, Gonghang-ro, Jung-gu, Incheon, Republic ...",Incheon International Airport,Airport

In [47]:
official_df

,official id,country,language,role,city,name
0,1,KR,ko,coach,23010520,'Kim Min Ho'
1,2,US,en,judge,23060500,'Charles Otto Puth Jr.
2,3,DE,de,coach,23070580,Hermann Karl Hesse
3,4,JP,ja,psysician,23060540,Ken Shimizu
4,5,IN,hi,psysician,23060670,'Mohammed Aamir Hussain Khan

In [48]:
vehicle_maintenance_df

,vehicle id,action type,odometer,finalcost,description,start date,end date
0,1000,M,4350,300,Tire replacement,2022-10-15,2022-10-15
1,1001,R,2195,1000,Engine replacement,2022-10-17,2022-10-18

In [41]:
vehicle_list_df

,vehicle id,registration,manufacturer,model,color,current odometer,passanger capacity
0,1000,2001ABC,Volvo,XC90 SE,Silver,4350,4
1,1001,2006AFD,Kia,K7,Black,2195,4
2,1002,2021AHR,Telsa,2020 F,White,590,4
3,1003,2020DXF,Ford,Transit,Silver,974,2

In [56]:
insert_data = [[1004, '2022AAA', 'Kia','K9', 'Blue', 1000, 4]]
insert_sql = "INSERT INTO vehicle_list VALUES (%s, %s, %s, %s, %s, %s, %s);"

In [57]:
cursor.executemany(insert_sql, insert_data)

1

In [58]:
vehicle_list_df=pd.read_sql_query("SELECT * FROM vehicle_list",conn)

C:\Users\Public\Documents\Wondershare\CreatorTemp\ipykernel_764\3853487725.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vehicle_list_df=pd.read_sql_query("SELECT * FROM vehicle_list",conn)

In [59]:
vehicle_list_df

,vehicle id,registration,manufacturer,model,color,current odometer,passanger capacity
0,1000,2001ABC,Volvo,XC90 SE,Silver,4350,4
1,1001,2006AFD,Kia,K7,Black,2195,4
2,1002,2021AHR,Telsa,2020 F,White,590,4
3,1003,2020DXF,Ford,Transit,Silver,974,2
4,1004,2022AAA,Kia,K9,Blue,1000,4